In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('pizza_sales.csv')
df.head(2)

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name
0,1,1,hawaiian_m,1,01-01-2015,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza
1,2,2,classic_dlx_m,1,01-01-2015,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza

In [3]:
df.shape

(48620, 12)

In [4]:
df.describe()

           pizza_id      order_id      quantity    unit_price   total_price
count  48620.000000  48620.000000  48620.000000  48620.000000  48620.000000
mean   24310.500000  10701.479761      1.019622     16.494132     16.821474
std    14035.529381   6180.119770      0.143077      3.621789      4.437398
min        1.000000      1.000000      1.000000      9.750000      9.750000
25%    12155.750000   5337.000000      1.000000     12.750000     12.750000
50%    24310.500000  10682.500000      1.000000     16.500000     16.500000
75%    36465.250000  16100.000000      1.000000     20.250000     20.500000
max    48620.000000  21350.000000      4.000000     35.950000     83.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48620 entries, 0 to 48619
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   pizza_id           48620 non-null  int64
 1   order_id           48620 non-null  int64
 2   pizza_name_id      48620 non-null  object
 3   quantity           48620 non-null  int64
 4   order_date         48620 non-null  object
 5   order_time         48620 non-null  object
 6   unit_price         48620 non-null  float64
 7   total_price        48620 non-null  float64
 8   pizza_size         48620 non-null  object
 9   pizza_category     48620 non-null  object
 10  pizza_ingredients  48620 non-null  object
 11  pizza_name         48620 non-null  object
dtypes: float64(2), int64(3), object(7)
memory usage: 4.5+ MB

In [6]:
df.head(2)

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name
0,1,1,hawaiian_m,1,01-01-2015,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza
1,2,2,classic_dlx_m,1,01-01-2015,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza

#### ***Total Revenue***

In [7]:
total_revenue = df['total_price'].sum()
total_revenue

817860.05

#### ***Average Order Value***

In [8]:
total_orders = df['order_id'].nunique()
avg_order_value = total_revenue/total_orders
round(avg_order_value,2)

38.31

#### ***Total Pizzas Sold***

In [9]:
total_pizzas_sold = df['quantity'].sum()
total_pizzas_sold

49574

#### ***Total Orders***

In [10]:
total_orders = df['order_id'].nunique()
total_orders

21350

#### ***Average Pizzas Per Order***

In [11]:
avg_pizzas_per_order = total_pizzas_sold/total_orders
round(avg_pizzas_per_order,2)

2.32

#### ***Daily Trend of total orders***

In [12]:
df['order_date'] = pd.to_datetime(df['order_date'], format="%d-%m-%Y")

In [13]:
df['order_date'][0].month_name()

'January'

In [14]:
day_name = df['order_date'].apply(lambda x: x.day_name())

In [15]:
orders_by_day = df.groupby(day_name)['order_id'].nunique()
orders_by_day

order_date
Friday       3538
Monday       2794
Saturday     3158
Sunday       2624
Thursday     3239
Tuesday      2973
Wednesday    3024
Name: order_id, dtype: int64

#### ***Monthly Trend of total orders***

In [16]:
month_name = df['order_date'].apply(lambda x: x.month_name())
month_name.head()

0    January
1    January
2    January
3    January
4    January
Name: order_date, dtype: object

In [17]:
orders_by_month = df.groupby(month_name)['order_id'].nunique()
orders_by_month

order_date
April        1799
August       1841
December     1680
February     1685
January      1845
July         1935
June         1773
March        1840
May          1853
November     1792
October      1646
September    1661
Name: order_id, dtype: int64

#### ***Percentage of Sales By Pizza Category***

In [18]:
df.head(2)

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name
0,1,1,hawaiian_m,1,2015-01-01,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza
1,2,2,classic_dlx_m,1,2015-01-01,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza

In [19]:
pizza_category_grp = df.groupby(['pizza_category'])

In [20]:
pizza_category_grp['total_price'].sum().apply(lambda x: (x/total_revenue)*100)

pizza_category
Chicken    23.955138
Classic    26.905960
Supreme    25.456311
Veggie     23.682591
Name: total_price, dtype: float64

#### ***Percentage of Sales By Pizza Category and month***

In [21]:
pizza_category_date_grp = df.groupby(['pizza_category', month_name])

In [22]:
df_pizza_date_grp = pizza_category_date_grp['total_price'].sum().reset_index()
df_pizza_date_grp.head()

  pizza_category order_date  total_price
0        Chicken      April     16473.00
1        Chicken     August     16352.50
2        Chicken   December     15739.75
3        Chicken   February     15468.25
4        Chicken    January     16188.75

In [23]:
df_pizza_date_grp[df_pizza_date_grp['order_date'] == 'March']

   pizza_category order_date  total_price
7         Chicken      March     17625.50
19        Classic      March     18116.60
31        Supreme      March     17319.65
43         Veggie      March     17335.35

#### ***Percentage of Sales By Pizza Size***

In [24]:
pizza_size_grp = df.groupby('pizza_size')

In [25]:
a = pizza_size_grp['total_price'].sum().apply(lambda x: (x/total_revenue)*100)
a.name = 'pct_sales'

In [26]:
b= pizza_size_grp['total_price'].sum()
b.name = 'total_sales'

In [27]:
pd.concat([b,a], axis=1)

            total_sales  pct_sales
pizza_size
L             375318.70  45.890333
M             249382.25  30.492044
S             178076.50  21.773468
XL             14076.00   1.721077
XXL             1006.60   0.123077

#### ***Top & Bottom 5 bestselling Pizzas by Total Revenue***

In [28]:
df.head(3)

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name
0,1,1,hawaiian_m,1,2015-01-01,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza
1,2,2,classic_dlx_m,1,2015-01-01,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza
2,3,2,five_cheese_l,1,2015-01-01,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza

In [29]:
pizza_name_grp = df.groupby('pizza_name')

In [30]:
top_selling_pizzas_revenue = pizza_name_grp['total_price'].sum().sort_values(ascending=False)[:5]
top_selling_pizzas_revenue

pizza_name
The Thai Chicken Pizza          43434.25
The Barbecue Chicken Pizza      42768.00
The California Chicken Pizza    41409.50
The Classic Deluxe Pizza        38180.50
The Spicy Italian Pizza         34831.25
Name: total_price, dtype: float64

In [31]:
bottom_selling_pizzas_revenue = pizza_name_grp['total_price'].sum().sort_values()[:5]
bottom_selling_pizzas_revenue

pizza_name
The Brie Carre Pizza         11588.50
The Green Garden Pizza       13955.75
The Spinach Supreme Pizza    15277.75
The Mediterranean Pizza      15360.50
The Spinach Pesto Pizza      15596.00
Name: total_price, dtype: float64

#### ***Top & Bottom 5 bestselling Pizzas by Total Orders***

In [32]:
df.head(2)

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name
0,1,1,hawaiian_m,1,2015-01-01,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza
1,2,2,classic_dlx_m,1,2015-01-01,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza

In [33]:
top_selling_pizzas_orders = pizza_name_grp['order_id'].nunique().sort_values(ascending=False)[:5]
top_selling_pizzas_orders

pizza_name
The Classic Deluxe Pizza      2329
The Hawaiian Pizza            2280
The Pepperoni Pizza           2278
The Barbecue Chicken Pizza    2273
The Thai Chicken Pizza        2225
Name: order_id, dtype: int64

In [34]:
bottom_selling_pizzas_orders = pizza_name_grp['order_id'].nunique().sort_values()[:5]
bottom_selling_pizzas_orders

pizza_name
The Brie Carre Pizza         480
The Mediterranean Pizza      912
The Calabrese Pizza          918
The Spinach Supreme Pizza    918
The Chicken Pesto Pizza      938
Name: order_id, dtype: int64

#### ***Top & Bottom 5 bestselling Pizzas by Total Quantity***

In [35]:
top_selling_pizzas_quantity = pizza_name_grp['quantity'].sum().sort_values(ascending=False)[:5]
top_selling_pizzas_quantity

pizza_name
The Classic Deluxe Pizza      2453
The Barbecue Chicken Pizza    2432
The Hawaiian Pizza            2422
The Pepperoni Pizza           2418
The Thai Chicken Pizza        2371
Name: quantity, dtype: int64

In [36]:
bottom_selling_pizzas_quantity = pizza_name_grp['quantity'].sum().sort_values()[:5]
bottom_selling_pizzas_quantity

pizza_name
The Brie Carre Pizza         490
The Mediterranean Pizza      934
The Calabrese Pizza          937
The Spinach Supreme Pizza    950
The Soppressata Pizza        961
Name: quantity, dtype: int64